src/cf/InformationRegisters/бпсСвойстваЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>бпсСвойстваЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.бпсЗадача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/бпсСвойстваЗадач/Ext/ManagerModule.bsl
Функция ПолучитьЗначениеСвойстваЗадачи(ЗадачаСсылка,ИмяСвойства) Экспорт 
	Если НЕ ЗначениеЗаполнено(ЗадачаСсылка) Тогда
		ВызватьИсключение "Ошибка! Не заполнен параметр ЗадачаСсылка";
	Конецесли;	
	Если НЕ ЗначениеЗаполнено(ИмяСвойства) Тогда
		ВызватьИсключение "Ошибка! Не заполнен параметр ИмяСвойства";
	Конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бпсСвойстваЗадач.Задача,
	|	бпсСвойстваЗадач.Пользователь,
	|	бпсСвойстваЗадач."+ИмяСвойства+" КАК ЗначениеСвойства
	|ИЗ
	|	РегистрСведений.бпсСвойстваЗадач КАК бпсСвойстваЗадач
	|ГДЕ
	|	бпсСвойстваЗадач.Задача = &ЗадачаСсылка
	|	И бпсСвойстваЗадач.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("ЗадачаСсылка", ЗадачаСсылка);
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.ЗначениеСвойства;	
		КонецЦикла;
	Конецесли;
	
КонецФункции 

Процедура УстановитьЗначениеСвойстваЗадачи(ЗадачаСсылка,ИмяСвойства,ЗначениеСвойства) Экспорт
	Если НЕ ЗначениеЗаполнено(ЗадачаСсылка) Тогда
		ВызватьИсключение "Ошибка! Не заполнен параметр ЗадачаСсылка";
	Конецесли;
	Если НЕ ЗначениеЗаполнено(ИмяСвойства) Тогда
		ВызватьИсключение "Ошибка! Не заполнен параметр ИмяСвойства";
	Конецесли;
	МенеджерЗаписи = РегистрыСведений.бпсСвойстваЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = ЗадачаСсылка;
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи[ИмяСвойства] = ЗначениеСвойства;
	МенеджерЗаписи.Записать();
КонецПроцедуры 

Функция ПолучитьИмяСвойстваСкрыта() Экспорт
	Возврат "Скрыта";
КонецФункции
